export default [
  {
    id: 0,
    title: "دعای عفو در شب‌های رمضان",
    arabic: [
      {
        number: 1,
        ayah: "اللَّهُمَّ إِنَّكَ عَفُوٌ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
        translation: "خدایا! تو عفو کننده‌ای و دوست داری عفو کنی، پس مرا ببخش.",
      },
    ],
    category: "dua",
    audio: "/audio/dua/dua-1.mp3",
  },

  {
    id: 1,
    title: "دعای بعد افطار",
    arabic: [
      {
        number: 1,
        ayah: "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ",

        translation:
          "خدایا، تشنگی رفت و رگ‌ها تر شد و پاداش ثابت گردید، اگر الله بخواهد.",
      },
    ],

    category: "dua",
    audio: "/audio/dua/dua-2.mp3",
  },

  {
    id: 2,
    title: "دعای هنگام افطار در مهمانی",
    arabic: [
      {
        number: 1,
        ayah: "أفطر عندكم الصائمون، وأكل طعامكم الأبرار، و صلت عليكم الملائكة.",
        translation:
          "روزه‌داران نزد شما افطار کردند، نیکوکاران از غذای شما خوردند، و فرشتگان بر شما درود فرستادند.",
      },
    ],
    category: "dua",
    audio: "/audio/dua/dua-3.mp3",
  },
];
