export default [
    {
      question: "هدف از روزه گرفتن چیست؟",
      answer:
        "روزه تمرینی برای کنترل نفس است. خودداری از غذا، نوشیدنی و رابطه جنسی دشوار است زیرا این‌ها از قوی‌ترین تمایلات انسانی هستند. با یادگیری خودداری از این نیازهای اساسی برای مدتی، مسلمانان مهارت کنترل نفس را کسب می‌کنند تا بتوانند آن را در سایر جنبه‌های زندگی خود به کار گیرند. این امر باعث افزایش تقوا و آگاهی از خداوند می‌شود که هدف اصلی روزه است.",
    },
    {
      question: "چرا رمضان ماه ویژه‌ای است؟ چرا در این ماه روزه گرفته می‌شود؟",
      answer:
        "رمضان ماهی است که در آن قرآن برای اولین بار نازل شد. خداوند این ماه را به عنوان ماهی ویژه تعیین کرد تا نزول قرآن را گرامی بدارد.",
    },
    {
      question: "فرزندان از چه سنی باید روزه بگیرند؟",
      answer:
        "پیامبر اسلام (ص) آموزش داد که کودکان از هفت‌سالگی باید نماز را یاد بگیرند و از ده‌سالگی باید به طور منظم آن را بخوانند. همین قاعده برای روزه نیز صدق می‌کند. از سن هفت سالگی، کودکان باید با روزه آشنا شوند و گاهی آن را تمرین کنند. از ده‌سالگی، والدین باید آن‌ها را تشویق کنند تا کل ماه رمضان را، یا به اندازه‌ای که توان دارند، روزه بگیرند.",
    },
    {
      question: "چقدر بیمار باید باشیم تا روزه نگیریم؟",
      answer:
        "اگر فردی دچار بیماری‌ای باشد که روزه گرفتن ممکن است به بدنش آسیب برساند، بیماری‌اش را تشدید کند یا روند بهبود او را به تأخیر بیندازد، از روزه معاف است. شدت بیماری را می‌توان با مشورت پزشک تعیین کرد. افراد با سرماخوردگی خفیف یا تب جزئی همچنان باید روزه بگیرند، مگر اینکه روزه گرفتن باعث آسیب جدی شود.",
    },
    {
      question: "آیا زنان باردار باید روزه بگیرند؟",
      answer:
        "بسیاری از زنان باردار روزه می‌گیرند بدون اینکه آسیبی به خودشان یا کودکشان وارد شود. با این حال، این موضوع به سلامت مادر، فصل سال و سبک زندگی او بستگی دارد. بهتر است با یک پزشک متخصص مشورت شود تا در صورت وجود خطر برای مادر یا جنین، از روزه گرفتن خودداری کند و بعداً روزه‌های خود را قضا کند.",
    },
    {
      question: "آیا زنان شیرده باید روزه بگیرند؟",
      answer:
        "برخی از زنان در دوران شیردهی روزه می‌گیرند و مشکلی برای آن‌ها یا میزان شیرشان پیش نمی‌آید. اما این بستگی به وضعیت سلامت مادر، فصل سال و سبک زندگی او دارد. اگر پزشک تشخیص دهد که روزه گرفتن ممکن است تأثیری بر سلامت مادر یا میزان شیر داشته باشد، مادر می‌تواند روزه نگیرد و بعداً قضای آن را به جا آورد.",
    },
    {
      question:
        "اگر زنی چندین سال متوالی باردار باشد و نتواند روزه بگیرد، چه باید بکند؟",
      answer:
        "اگر زنی به دلیل بارداری و شیردهی چندین رمضان را از دست بدهد، باید روزه‌های خود را در اولین فرصت ممکن قضا کند. او می‌تواند روزه‌های قضا را در زمستان که روزها کوتاه‌تر است بگیرد و آن‌ها را در روزهای پراکنده جبران کند تا آسان‌تر باشد.",
    },
    {
      question:
        "اگر فردی دچار بیماری مزمن باشد یا خیلی پیر باشد، تکلیف روزه چیست؟",
      answer:
        "افرادی که بیماری مزمن دارند یا در سنین بالا هستند و روزه برای آن‌ها ضرر دارد، لازم نیست روزه بگیرند. اما آن‌ها باید به ازای هر روز، یک فرد فقیر را با دو وعده غذایی تأمین کنند تا ثواب روزه را کسب کنند.",
    },
    {
      question: "آیا می‌توان در هنگام سفر روزه گرفت؟",
      answer:
        "مسافر از روزه معاف است، زیرا سفر سختی‌ها و مشکلاتی دارد. اما اگر سفر راحت باشد، بهتر است روزه گرفته شود. روزه‌هایی که به دلیل سفر از دست رفته‌اند، باید بعد از بازگشت قضا شوند.",
    },
    {
      question:
        "چرا برخی مساجد در یک منطقه روزه را در روزهای متفاوتی آغاز و پایان می‌دهند؟",
      answer:
        "اختلاف در شروع و پایان رمضان به دلیل تفاوت نظر علما در تعیین رؤیت هلال ماه است. بهترین کار این است که فرد از مسجدی که به علم اسلامی آن اعتماد دارد پیروی کند. اگر این اختلاف موجب تفرقه در خانواده شود، می‌توان با رعایت تقوا از نظر مسجد دیگر پیروی کرد.",
    },
    {
      question: "آیا استفراغ روزه را باطل می‌کند؟",
      answer:
        "استفراغ عمدی و زیاد که با فشار خارج شود و قابل کنترل نباشد، روزه را باطل می‌کند. اما استفراغ غیرعمدی روزه را باطل نمی‌کند.",
    },
    {
      question: "آیا استفاده از قطره چشم، گوش، بینی یا تنقیه اشکالی دارد؟",
      answer:
        "استفاده از قطره چشم، گوش و بینی اشکالی ندارد، زیرا معمولاً مایع به معده نمی‌رسد و خاصیت تغذیه‌ای ندارد. اما در استفاده از قطره بینی باید دقت شود که مایع به دهان نرسد. همچنین استفاده از تنقیه برای پاکسازی روده یا دریافت دارو مشکلی ندارد، اما اگر برای تغذیه و آبرسانی باشد و به معده برسد، روزه را باطل می‌کند.",
    },
    {
      question: "آیا تزریق دارویی روزه را باطل می‌کند؟",
      answer:
        "تزریق دارو که خاصیت تغذیه‌ای نداشته باشد و به معده نرسد، روزه را باطل نمی‌کند. اما تزریق گلوکز یا هر ماده مغذی دیگر روزه را باطل می‌کند.",
    },
    {
      question: "آیا می‌توانم هنگام روزه مسواک بزنم؟",
      answer:
        "مسواک زدن در حال روزه اشکالی ندارد و حتی توصیه می‌شود. استفاده از خمیردندان نیز مشکلی ندارد، به شرط آنکه مراقب باشید چیزی از آن را قورت ندهید. بهتر است قبل از اذان صبح دندان‌ها را با خمیردندان مسواک بزنید تا از طعم آن در دهان جلوگیری شود.",
    },
    {
      question: "آیا می‌توانم از دهان‌شویه استفاده کنم؟",
      answer:
        "استفاده از دهان‌شویه در روزه توصیه نمی‌شود، زیرا طعم آن در دهان باقی می‌ماند. اما اگر برای از بین بردن بوی بد دهان نیاز باشد، اشکالی ندارد، مشروط بر اینکه چیزی قورت داده نشود.",
    },
    {
      question:
        "اگر به طور اتفاقی تکه‌های کوچک غذا را که در بین دندان‌ها گیر کرده بود ببلعم، روزه‌ام باطل می‌شود؟",
      answer:
        "خیر، بلعیدن ناخواسته تکه‌های کوچک غذا که در بین دندان‌ها بوده است، روزه را باطل نمی‌کند.",
    },
    {
      question: "آیا می‌توانم در حال روزه خون اهدا کنم؟",
      answer:
        "اهدا کردن خون روزه را باطل نمی‌کند، اما اگر باعث ضعف شدید شود و روزه را دشوار کند، مکروه است.",
    },
    {
      question: "آیا می‌توانم از اسپری آسم استفاده کنم؟",
      answer:
        "استفاده از اسپری آسم روزه را باطل نمی‌کند، زیرا نه خاصیت تغذیه‌ای دارد و نه به معده می‌رسد.",
    },
    {
      question: "آیا می‌توانم هنگام روزه عطر یا ادکلن بزنم؟",
      answer:
        "بله، استفاده از عطر یا ادکلن هنگام روزه گرفتن اشکالی ندارد، زیرا استنشاق آن خاصیت تغذیه‌ای ندارد و به معده نمی‌رسد.",
    },
    {
      question: "آیا می‌توانم دهانم را با آب بشویم یا برای خنک شدن دوش بگیرم؟",
      answer: "این کار مجاز است و تأثیری بر روزه ندارد. انجام این کار هیچ اشکالی ندارد و مکروه هم نیست."
    },
    {
      question: "تا چه زمانی باید روزه‌های قضا شده را جبران کنم؟",
      answer: "کسی که روزه‌ای را از دست داده است، باید قبل از رمضان بعدی آن را قضا کند. با این حال، توصیه می‌شود بدون دلیل تأخیر نیندازد. اگر بیش از یک روزه قضا داشته باشد، می‌تواند آن‌ها را پشت سر هم یا جدا جدا بگیرد، اما پشت سر هم گرفتن بهتر است. اگر تا رمضان بعدی قضای روزه را انجام ندهد، همچنان باید آن را بگیرد، اما در صورت نداشتن عذر، گناهکار خواهد بود."
    },
    {
      question: "اگر در ماه رمضان به دلیل گرسنگی روزه‌ام را بشکنم، آیا فقط باید از خداوند طلب مغفرت کنم؟",
      answer: "کسی که عمداً و بدون عذر شرعی روزه خود را در ماه رمضان با خوردن، نوشیدن یا رابطه زناشویی بشکند، نه تنها باید آن روز را قضا کند، بلکه کفاره نیز بر او واجب می‌شود. این برای تأکید بر اهمیت روزه رمضان است. کفاره آن است که باید شصت روز متوالی روزه بگیرد. اگر قادر به این کار نباشد، باید به شصت فقیر دو وعده غذایی بدهد. همچنین می‌تواند به یک فقیر برای شصت روز غذا بدهد یا معادل نقدی آن را بپردازد. کسی که بیش از یک بار در رمضان روزه خود را عمداً شکسته باشد، همچنان فقط یک بار کفاره می‌دهد."
    },
    {
      question: "چرا برخی ۸ رکعت و برخی دیگر ۲۰ رکعت نماز تراویح می‌خوانند؟",
      answer: "در مورد تعداد رکعت‌های نماز تراویح بین علما اختلاف نظر وجود دارد. بهتر است از روشی که مسجدی که در آن نماز می‌خوانید پیروی می‌کند، تبعیت کنید و به نظر دیگران اعتراض نکنید."
    },
    {
      question: "زکات فطر چیست و چه زمانی باید پرداخت شود؟",
      answer: "زکات فطر یا صدقه فطر یک صدقه واجب است که در پایان رمضان پرداخت می‌شود. این صدقه به نیازمندان کمک می‌کند تا روز عید را بدون دغدغه مالی سپری کنند. پرداخت زکات فطر بر هر مسلمانی که حداقل مقدار دارایی لازم (نصاب) را داشته باشد، واجب است. مرد باید برای خود و فرزندان خردسالش بپردازد، و زن باید برای خود بپردازد. این واجب از طلوع فجر روز عید آغاز می‌شود، و هرکس در آن زمان نصاب را داشته باشد، باید آن را بپردازد. زکات فطر باید قبل از نماز عید پرداخت شود. اگر کسی پرداخت آن را به تأخیر بیندازد، همچنان بر او واجب خواهد بود. توصیه می‌شود زودتر پرداخت شود تا به دست نیازمندان برسد. پرداخت آن از روز اول رمضان نیز جایز است. مقدار آن برابر با چهار کف دست پر از خرما، جو، کشمش یا هر غذای اصلی دیگر است. اگر پرداخت نقدی برای نیازمندان مفیدتر باشد، جایز است. زکات فطر مانند زکات مال فقط باید به فقرا و نیازمندانی که کمتر از مقدار معینی از طلا دارند، داده شود."
    },
    {
      question: "آیا می‌توانم هنگام روزه به دندان‌پزشک مراجعه کنم؟",
      answer: "بهتر است در هنگام روزه‌داری از انجام درمان‌های دندان‌پزشکی خودداری کنید، زیرا احتمال دارد که آب یا دارو ناخواسته بلعیده شود. اگر آبی بلعیده شود که قابل اجتناب بود، روزه باطل می‌شود."
    },
    {
      question: "آیا می‌توانم هنگام روزه شنا کنم؟",
      answer: "شنا کردن در حال روزه گرفتن جایز است، به شرطی که آب بلعیده نشود."
    },
    {
      question: "آیا باید هر شب نیت روزه کنم؟",
      answer: "چون روزه یک عبادت است، باید نیت آن وجود داشته باشد تا صحیح باشد. به عنوان مثال، اگر کسی بدون نیت عبادت و فقط برای رژیم غذایی از خوردن و آشامیدن خودداری کند، روزه محسوب نمی‌شود. برای ماه رمضان، کافی است که نیت کلی داشته باشید که قصد دارید کل ماه را روزه بگیرید. اگر به دلیل بیماری یا سفر نیت تغییر کند، باید دوباره قبل از شروع روزه نیت کند."
    },
    {
      question: "آیا می‌توانم نماز وتر را پشت سر امامی که شیوه متفاوتی دارد، بخوانم؟",
      answer: "در ماه رمضان، نماز وتر معمولاً به جماعت خوانده می‌شود. اگر امام نماز وتر را به روشی متفاوت از روش شما بخواند، توصیه می‌شود مطابق شیوه او نماز را بخوانید. در مورد نحوه ادای نماز وتر میان علما اختلاف نظر وجود دارد، و بهتر است هنگام اقتدا به امام، از روش او پیروی کنید."
    },
    {
      question: "آیا می‌توانم در نماز تراویح قرآن یا دستگاه الکترونیکی در دست بگیرم؟",
      answer: "نگه داشتن قرآن در نماز می‌تواند باعث حرکات غیرضروری شود، به‌ویژه هنگام رفتن به سجده. هدف اصلی نماز جماعت این است که به تلاوت قرآن گوش داده شود، نه اینکه خوانده شود. اگر کسی در تمرکز مشکل دارد، می‌تواند از روش‌های دیگری برای بهبود تمرکز خود استفاده کند. استفاده از دستگاه الکترونیکی نیز همانند نگه داشتن قرآن است، بلکه ممکن است بدتر باشد، زیرا نور صفحه نمایش باعث حواس‌پرتی دیگر نمازگزاران می‌شود."
    }
  ];