export default [
    {
      title: "تعریف رمضان",
      content: [
        {
          type: "text",
          content: ' رمضان در لغت از "رمضاء" به معناى شدت حرارت گرفته شده و به معناى سوزانیدن مى باشد، زیرا در این ماه گناهان انسان بخشیده مى شود. پیامبر اکرم (ص) مى فرماید: '
        },
        {
          type: "hadith",
          arabic: "إِنَّمَا سُمِّيَ الرَّمَضَانُ لِأَنَّهُ يُرْمِضُ الذُّنُوبَ",
          translation: "ماه رمضان به این نام خوانده شده است، زیرا گناهان را مى‏سوزاند",
          narrator: "پیامبر اکرم (ص)",
          source: "صحیح بخاری",
          reference: 1
        },
        {
          type: "text",
          content: "رمضان نام یکى از ماه‏های قمرى و تنها ماهى است که نامش در قرآن کریم آمده است. همچنین یکی از چهار ماهى است که خداوند جنگ را در آن حرام کرده است (مگر در حالت دفاعی). در این ماه کتاب‏های آسمانى مانند قرآن کریم، انجیل، تورات، صحف و زبور نازل شده‌اند."
        },
        {
          type: "hadith",
          arabic: "ماه رجب، ماه خداست؛ ماه شعبان، ماه من است و ماه رمضان، ماه امت من است",
          translation: "",
          narrator: "پیامبر اکرم (ص)",
          source: "صحیح مسلم",
          reference: 2
        }
      ]
    },
  
  ]