
 export default [
    {
      id: 0,
      title: "سوره قدر",
      arabic: [
        {
          number: 1,
          ayah: "إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ",
        },
        {
          number: 2,
          ayah: "وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ",
        },
        {
          number: 3,
          ayah: "لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ",
        },
        {
          number: 4,
          ayah: "تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ",
        },
        {
          number: 5,
          ayah: "سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ",
        },
      ],
      translation: "ما آن [قرآن] را در شب قدر نازل کردیم",
      category: "surah",
      audio: "/audio/surah/surah-1.mp3",
    },
    {
      id: 1,
      title: "سوره اخلاص",
      arabic:[
        {
          "number": 1,
          "ayah": "قُلْ هُوَ ٱللَّهُ أَحَدٌ"
        },
        {
          "number": 2,
          "ayah": "ٱللَّهُ ٱلصَّمَدُ"
        },
        {
          "number": 3,
          "ayah": "لَمْ يَلِدْ وَلَمْ يُولَدْ"
        },
        {
          "number": 4,
          "ayah": "وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ"
        }
      ],       
      translation: "ما آن [قرآن] را در شب قدر نازل کردیم",
      category: "surah",
      audio: "/audio/surah/surah-2.mp3",
    },
    {
      id: 2,
      title: "سوره ناس",
      arabic:[
        {
          "number": 1,
          "ayah": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ"
        },
        {
          "number": 2,
          "ayah": "مَلِكِ ٱلنَّاسِ"
        },
        {
          "number": 3,
          "ayah": "إِلَٰهِ ٱلنَّاسِ"
        },
        {
          "number": 4,
          "ayah": "مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ"
        },
        {
          "number": 5,
          "ayah": "ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ"
        },
        {
          "number": 6,
          "ayah": "مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ"
        }
      ]
      ,       
      translation: "ما آن [قرآن] را در شب قدر نازل کردیم",
      category: "surah",
      audio: "/audio/surah/surah-3.mp3",
    },
    {
      id: 3,
      title: "سوره فلق",
      arabic:[
        {
          "number": 1,
          "ayah": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ"
        },
        {
          "number": 2,
          "ayah": "مِن شَرِّ مَا خَلَقَ"
        },
        {
          "number": 3,
          "ayah": "وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ"
        },
        {
          "number": 4,
          "ayah": "وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ"
        },
        {
          "number": 5,
          "ayah": "وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ"
        }
      ],       
      translation: "ما آن [قرآن] را در شب قدر نازل کردیم",
      category: "surah",
      audio: "/audio/surah/surah-4.mp3",
    },
    {
        id: 4,
        title: "سوره الرحمن",
        arabic:[
            {
              "number": 1,
              "ayah": "ٱلرَّحْمَٰنُ"
            },
            {
              "number": 2,
              "ayah": "عَلَّمَ ٱلْقُرْءَانَ"
            },
            {
              "number": 3,
              "ayah": "خَلَقَ ٱلْإِنسَٰنَ"
            },
            {
              "number": 4,
              "ayah": "عَلَّمَهُ ٱلْبَيَانَ"
            },
            {
              "number": 5,
              "ayah": "ٱلشَّمْسُ وَٱلْقَمَرُ بِحُسْبَانٍ"
            },
            {
              "number": 6,
              "ayah": "وَٱلنَّجْمُ وَٱلشَّجَرُ يَسْجُدَانِ"
            },
            {
              "number": 7,
              "ayah": "وَٱلسَّمَآءَ رَفَعَهَا وَوَضَعَ ٱلْمِيزَانَ"
            },
            {
              "number": 8,
              "ayah": "أَلَّا تَطْغَوْا۟ فِى ٱلْمِيزَانِ"
            },
            {
              "number": 9,
              "ayah": "وَأَقِيمُوا۟ ٱلْوَزْنَ بِٱلْقِسْطِ وَلَا تُخْسِرُوا۟ ٱلْمِيزَانَ"
            },
            {
              "number": 10,
              "ayah": "وَٱلْأَرْضَ وَضَعَهَا لِلْأَنَامِ"
            },
            {
              "number": 11,
              "ayah": "فِيهَا فَٰكِهَةٌۭ وَٱلنَّخْلُ ذَاتُ ٱلْأَكْمَامِ"
            },
            {
              "number": 12,
              "ayah": "وَٱلْحَبُّ ذُو ٱلْعَصْفِ وَٱلرَّيْحَانُ"
            },
            {
              "number": 13,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            },
            {
              "number": 14,
              "ayah": "خَلَقَ ٱلْإِنسَٰنَ مِن صَلْصَٰلٍۢ كَٱلْفَخَّارِ"
            },
            {
              "number": 15,
              "ayah": "وَخَلَقَ ٱلْجَآنَّ مِن مَّارِجٍۢ مِّن نَّارٍۢ"
            },
            {
              "number": 16,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            },
            {
              "number": 17,
              "ayah": "رَبُّ ٱلْمَشْرِقَيْنِ وَرَبُّ ٱلْمَغْرِبَيْنِ"
            },
            {
              "number": 18,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            },
            {
              "number": 19,
              "ayah": "مَرَجَ ٱلْبَحْرَيْنِ يَلْتَقِيَانِ"
            },
            {
              "number": 20,
              "ayah": "بَيْنَهُمَا بَرْزَخٌۭ لَّا يَبْغِيَانِ"
            },
            {
              "number": 21,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            },
            {
              "number": 22,
              "ayah": "يَخْرُجُ مِنْهُمَا ٱللُّؤْلُؤُ وَٱلْمَرْجَانُ"
            },
            {
              "number": 23,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            },
            {
              "number": 24,
              "ayah": "وَلَهُ ٱلْجَوَارِ ٱلْمُنشَـَٔاتُ فِى ٱلْبَحْرِ كَٱلْأَعْلَٰمِ"
            },
            {
              "number": 25,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            },
            {
              "number": 26,
              "ayah": "كُلُّ مَنْ عَلَيْهَا فَانٍۢ"
            },
            {
              "number": 27,
              "ayah": "وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو ٱلْجَلَٰلِ وَٱلْإِكْرَامِ"
            },
            {
              "number": 28,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            },
            {
              "number": 29,
              "ayah": "يَسْـَٔلُهُۥ مَن فِى ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ كُلَّ يَوْمٍ هُوَ فِى شَأْنٍۢ"
            },
            {
              "number": 30,
              "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ"
            }, 
            { "number": 30, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 31, "ayah": "سَنَفْرُغُ لَكُمْ أَيُّهَا ٱلثَّقَلَانِ" },
            { "number": 32, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 33, "ayah": "يَٰمَعْشَرَ ٱلْجِنِّ وَٱلْإِنسِ إِنِ ٱسْتَطَعْتُمْ أَن تَنفُذُوا۟ مِنْ أَقْطَارِ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ فَٱنفُذُوا۟ ۚ لَا تَنفُذُونَ إِلَّا بِسُلْطَٰنٍۢ" },
            { "number": 34, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 35, "ayah": "يُرْسَلُ عَلَيْكُمَا شُوَاظٌۭ مِّن نَّارٍۢ وَنُحَاسٌۭ فَلَا ٱنتَصِرَانِ" },
            { "number": 36, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 37, "ayah": "فَإِذَا ٱنشَقَّتِ ٱلسَّمَآءُ فَكَانَتْ وَرْدَةًۭ كَٱلدِّهَانِ" },
            { "number": 38, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 39, "ayah": "فَيَوْمَئِذٍۢ لَّا يُسْـَٔلُ عَن ذَنۢبِهِۦٓ إِنسٌۭ وَلَا جَانٌّۭ" },
            { "number": 40, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 41, "ayah": "يُعْرَفُ ٱلْمُجْرِمُونَ بِسِيمَٰهُمْ فَيُؤْخَذُ بِٱلنَّوَٰصِى وَٱلْأَقْدَامِ" },
            { "number": 42, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 43, "ayah": "هَٰذِهِۦ جَهَنَّمُ ٱلَّتِى يُكَذِّبُ بِهَا ٱلْمُجْرِمُونَ" },
            { "number": 44, "ayah": "يَطُوفُونَ بَيْنَهَا وَبَيْنَ حَمِيمٍ آنٍۢ" },
            { "number": 45, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 46, "ayah": "وَلِمَنْ خَافَ مَقَامَ رَبِّهِۦ جَنَّتَانِ" },
            { "number": 47, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 48, "ayah": "ذَوَاتَآ أَفْنَانٍۢ" },
            { "number": 49, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 50, "ayah": "فِيهِمَا عَيْنَانِ تَجْرِيَانِ" },
            { "number": 51, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 52, "ayah": "فِيهِمَا مِن كُلِّ فَٰكِهَةٍۢ زَوْجَانِ" },
            { "number": 53, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 54, "ayah": "مُتَّكِـِٔينَ عَلَىٰ فُرُشٍۢ بَطَآئِنُهَا مِنْ إِسْتَبْرَقٍۢ ۚ وَجَنَى ٱلْجَنَّتَيْنِ دَانٍۢ" },
            { "number": 55, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 56, "ayah": "فِيهِنَّ قَٰصِرَٰتُ ٱلطَّرْفِ لَمْ يَطْمِثْهُنَّ إِنسٌۭ قَبْلَهُمْ وَلَا جَانٌّۭ" },
            { "number": 57, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 58, "ayah": "كَأَنَّهُنَّ ٱلْيَاقُوتُ وَٱلْمَرْجَانُ" },
            { "number": 59, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 60, "ayah": "هَلْ جَزَآءُ ٱلْإِحْسَٰنِ إِلَّا ٱلْإِحْسَٰنُ" }, 
            { "number": 61, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 62, "ayah": "وَمِن دُونِهِمَا جَنَّتَانِ" },
            { "number": 63, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 64, "ayah": "مُدْهَآمَّتَانِ" },
            { "number": 65, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 66, "ayah": "فِيهِمَا عَيْنَانِ نَضَّاخَتَانِ" },
            { "number": 67, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 68, "ayah": "فِيهِمَا فَٰكِهَةٌۭ وَنَخْلٌۭ وَرُمَّانٌۭ" },
            { "number": 69, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 70, "ayah": "فِيهِنَّ خَيْرَٰتٌ حِسَانٌۭ" },
            { "number": 71, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 72, "ayah": "حُورٌۭ مَّقْصُورَٰتٌۭ فِى ٱلْخِيَامِ" },
            { "number": 73, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 74, "ayah": "لَمْ يَطْمِثْهُنَّ إِنسٌۭ قَبْلَهُمْ وَلَا جَانٌّۭ" },
            { "number": 75, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 76, "ayah": "مُتَّكِـِٔينَ عَلَىٰ رَفْرَفٍ خُضْرٍۢ وَعَبْقَرِىٍّ حِسَانٍۢ" },
            { "number": 77, "ayah": "فَبِأَىِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ" },
            { "number": 78, "ayah": "تَبَٰرَكَ ٱسْمُ رَبِّكَ ذِى ٱلْجَلَٰلِ وَٱلْإِكْرَامِ" }
          ],       
        translation: "ما آن [قرآن] را در شب قدر نازل کردیم",
        category: "surah",
        audio: "/audio/surah/rahman.mp3",
      },
  ];