const EssentialInfo = () => {
  const essentialInfo = [
    {
      title: "ماه مبارک رمضان: فرصتی برای نزدیکی به خداوند و توبه",
      content: [
        {
          type: "text",
          content:
            "ماه رمضان، ماهی است که در قرآن کریم به عنوان ماه نزول قرآن و فرصت‌های ویژه‌ای برای رشد روحی و معنوی معرفی شده است. این ماه به عنوان یکی از بهترین ماه‌ها در تقویم اسلامی شناخته می‌شود که مسلمانان با روزه گرفتن، توبه، و تقویت تقوا به نزدیکی به خداوند و جلب رحمت الهی می‌پردازند.",
        },
      ],
    },
    {
      title: "تعریف ماه رمضان و دلیل نامگذاری آن",
      content: [
        {
          type: "text",
          content:
            "رمضان به معنای «سوزاندن» است و در واقع به دلیل اینکه این ماه گناهان را می‌سوزاند و روح انسان‌ها را پاک می‌کند، به این نام خوانده شده است. \n پیامبر اکرم (ص) فرموده‌اند: ",
        },
        {
          type: "hadith",
          arabic:
            "مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
          translation:
            "هر کس رمضان را با ایمان و برای خداوند روزه بگیرد، گناهان گذشته‌اش بخشیده می‌شود.",
          reference: 1,
        },
        {
          type: "text",
          content:
            "این ماه فرصتی است تا انسان‌ها از دنیای مادی خود فاصله بگیرند و روح خود را با عبادات خالصانه به خداوند نزدیک کنند.",
        },
      ],
    },
    {
      title: "نزول قرآن در ماه رمضان",
      content: [
        {
          type: "text",
          content:
            "یکی از ویژگی‌های خاص ماه رمضان این است که قرآن کریم در این ماه نازل شده است. خداوند متعال در آیه 185 سوره بقره می فرماید:",
        },
        {
          type: "ayah",
          arabic:
            "شَهْرُ رَمَضَانَ ٱلَّذِىٓ أُنزِلَ فِيهِ ٱلْقُرْءَانُ هُدًى لِّلنَّاسِ وَبَيِّنَـٰتٍ مِّنَ ٱلْهُدَىٰ وَٱلْفُرْقَانِ",
          translation:
            "ماه رمضان [همان ماه] است كه در آن قرآن فرو فرستاده شده است [كتابى ] كه مردم را راهبر و [متضمن] دلايل آشكار هدايت و [ميزان] تشخيص حق از باطل است",
          reference: 2,
        },
        {
          type: "text",
          content:
            " قرآن در این ماه به عنوان هدایت‌گری برای انسان‌ها معرفی شده است که راه درست زندگی را نشان می‌دهد. این نزول قرآن در ماه رمضان به مسلمانان یادآوری می‌کند که این ماه، ماه ارتباط بیشتر با کتاب الهی است.",
        },
      ],
    },
    {
      title: "ویژگی‌های خاص ماه رمضان",
      content: [
        {
          type: "text",
          content:
            "ماه رمضان دارای ویژگی‌های بسیار خاصی است که آن را از سایر ماه‌ها متمایز می‌کند:",
        },
        {
          type: "text",
          content:
            "گشوده شدن درهای بهشت و بسته شدن درهای جهنم: پیامبر اکرم (ص) در حدیثی می‌فرماید: ",
        },
        {
          type: "hadith",
          arabic:
            "إِذَا دَخَلَ شَهْرُ رَمَضَانَ، فُتِّحَتْ أَبْوَابُ السَّمَاءِ، وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ، وَسُلْسِلَتِ الشَّيَاطِينُ",
          translation:
            "هنگامی که ماه رمضان فرا می‌رسد، درهای آسمان گشوده، درهای جهنم بسته و شیاطین به زنجیر کشیده می‌شوند",

          reference: 3,
        },
        {
          type: "text",
          content:
            " این حدیث نشان‌دهنده فرصت‌های بی‌نظیری است که در این ماه برای کسب رحمت و بخشش الهی فراهم می‌شود. درهای بهشت به روی بندگان خدا باز است و آنها می‌توانند از این فرصت برای نزدیکی به خداوند بهره ببرند.",
        },
        {
          type: "text",
          content:
            "شب قدر: شب قدر که در شب‌های فرد از دهه آخر ماه رمضان واقع می‌شود، از هزار ماه بهتر است. قرآن در سوره قدر، آیه 3 می‌فرماید: ",
        },
        {
          type: "ayah", 
          arabic: "لَيْلَةُ ٱلْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ",
          translation: "شب قدر از هزار ماه ارجمندتر است", 
          reference: 4,
      
        }, 
        {
          type: "text", 
          content: "یعنی شب قدر از هزار ماه بهتر است. این شب فرصتی است که عبادت در آن برابر با عبادت هزار ماه می‌شود. در این شب، سرنوشت انسان‌ها برای سال بعد نوشته می‌شود و به همین دلیل عبادت و دعا در این شب بسیار ارزشمند است."
        }, 
        {
          type: "text",
          content:
            "گسترش رحمت الهی: در ماه رمضان، خداوند رحمت خاصی را بر بندگانش نازل می‌کند. پیامبر اکرم (ص) در حدیثی فرموده‌اند: «ماه رمضان ماه میهمانی خداست». این ماه فرصتی است که انسان‌ها می‌توانند از رحمت و مغفرت خداوند بهره‌مند شوند.",
        },
      ],
    },
    {
      title: "روزه؛ عملی که موجب تقوا می‌شود",
      content: [
        {
          type: "text",
          content:
            "روزه در ماه رمضان، نه تنها به معنای امتناع از خوردن و نوشیدن است، بلکه فرصت مناسبی برای تربیت نفس، تقویت اراده و جلوگیری از شهوات نفسانی است. قرآن در سوره بقره، آیه 183 می‌فرماید: «يا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ»، یعنی روزه بر شما فرض شده است همانطور که بر امت‌های پیشین فرض شده بود تا پرهیزگار شوید. روزه فرصتی است تا مسلمانان از تمام نیازهای دنیوی خود فاصله بگیرند و فقط بر عبادت و خدمت به خداوند متمرکز شوند.",
        },
      ],
    },
    {
      title: "توبه در ماه رمضان",
      content: [
        {
          type: "text",
          content:
            "ماه رمضان به عنوان ماه توبه و بازگشت به سوی خداوند شناخته می‌شود. در این ماه، مسلمانان از گناهان خود پشیمان شده و با نیت خالص به درگاه خداوند باز می‌گردند. در قرآن آمده است: «وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَارِحًا ثُمَّ اهْتَدَىٰ» (طه، آیه 82) یعنی من به درگاه خود بازگشت‌کنندگان را می‌بخشم و آنان را به راه راست هدایت می‌کنم. ماه رمضان فرصتی است برای توبه نصوح و نزدیکی به خداوند با قلبی پاک.",
        },
      ],
    },
    {
      title: "تمرین صبر در رمضان",
      content: [
        {
          type: "text",
          content:
            "ماه رمضان، ماه صبر است. پیامبر اکرم (ص) می‌فرماید: «صوم شهر الصبر»، یعنی روزه در ماه رمضان معادل با صبر است. این صبر نه تنها در برابر گرسنگی و تشنگی، بلکه در برابر آزمون‌های الهی و همچنین در مقابل گناهان و شهوت‌ها است. این ماه به انسان‌ها یادآوری می‌کند که صبر کردن در برابر سختی‌ها، خود فرصتی برای کسب پاداش‌های عظیم است.",
        },
      ],
    },
    {
      title: "حفظ قرآن و نمازهای مستحبی",
      content: [
        {
          type: "text",
          content:
            "ماه رمضان بهترین زمان برای تمرین و حفظ قرآن است. در این ماه، مسلمانان بیشتر به تلاوت قرآن می‌پردازند تا به این وسیله درک بهتری از دستورات الهی پیدا کنند. نمازهای مستحبی نظیر تهجد و شب‌های قدر نیز در این ماه از اهمیت ویژه‌ای برخوردار است. در روایات آمده است که پیامبر اکرم (ص) در این ماه به ویژه در شب‌های رمضان، نمازهای مستحبی بسیاری می‌خواند.",
        },
      ],
    },
    {
      title: "نتیجه‌گیری",
      content: [
        {
          type: "text",
          content:
            "ماه رمضان، ماهی است که خداوند در آن، فرصت‌هایی ویژه برای پاکسازی روح، توبه و عبادت فراهم کرده است. روزه گرفتن، نماز خواندن، تلاوت قرآن و دعا در این ماه همه به انسان کمک می‌کنند تا به رشد معنوی برسند. همچنین ماه رمضان فرصتی است که مسلمانان باید از آن بهره‌برداری کنند تا به تقوا و پرهیزگاری دست یابند و گناهان خود را بسوزانند.",
        },
        {
          type: "text",
          content:
            "این ماه، ماهی است که در آن، درهای رحمت خداوند گشوده می‌شود و انسان‌ها می‌توانند از مغفرت و رحمت الهی بهره‌مند شوند. باید این ماه را غنیمت بشماریم و از تمامی برکات آن بهره‌برداری کنیم تا در مسیر تعالی و نزدیکی به خداوند قرار گیریم.",
        },
      ],
    },
  ];
  return (
    <section
      id="essential"
      className="container mx-auto px-5 py-12 md:py-24 relative"
    >
      {/* Decorative background elements */}
      <div className="absolute inset-0 bg-background" />
      <div className="absolute inset-y-0 right-0 w-1/4 bg-primary/5 hidden lg:block" />

      {/* Content wrapper */}
      <div className="relative max-w-4xl mx-auto space-y-4 md:space-y-10 px-4 md:px-0">
        {/* Introduction */}
        {essentialInfo.map((info, index) => (
          <article key={index}>
            <h2 className="text-lg md:text-xl font-bold mb-6 md:mb-8 border-r-4 border-primary pr-6">
              {info.title}
            </h2>
            <div className="prose prose-lg prose-primary max-w-none text-right space-y-2">
              {info.content.map((item, itemIndex) => {
                if (item.type === "text") {
                  return (
                    <p
                      key={itemIndex}
                      className="text-sm text-justify md:text-base leading-relaxed"
                    >
                      {item.content}
                    </p>
                  );
                }

                if (item.type === "ayah") {
                  return (
                    <div
                      key={itemIndex}
                      className=" mr-2 font-arabic md:mr-6 relative bg-primary/5 rounded-lg border border-primary/10"
                    >
                      <div className="absolute right-0 top-0 bottom-0 w-1 bg-gradient-to-b from-primary/40 to-primary/10 rounded-r-lg" />
                      <div className="pr-6 py-1">
                        <p className="text-sm md:text-xl  leading-loose text-primary  mb-3">
                          ﴿ {item.arabic} ﴾
                        </p>

                        <p className="text-xs md:text-sm text-muted-foreground mb-2">
                          {item.translation}
                          <sup className="text-xs text-primary/80">
                            [<a href={`#${item.reference}`}>{item.reference}</a>
                            ]
                          </sup>
                        </p>
                      </div>
                    </div>
                  );
                }

                if (item.type === "hadith") {
                  return (
                    <div
                      key={itemIndex}
                      className="bg-accent/5 font-arabic italic rounded-lg border border-accent/10 mr-2 md:mr-6  relative"
                    >
                      <div className="absolute right-0 top-0 bottom-0 w-1 bg-gradient-to-b from-accent/40 to-accent/10 rounded-r-lg" />
                      <div className="pr-6 py-1">
                        <p className="text-sm md:text-lg  leading-loose mb-2">
                          " {item.arabic} "
                        </p>

                        <p className="text-xs md:text-lg text-muted-foreground">
                          {item.translation}
                          <sup className="text-xs text-primary/80">
                            [<a href={`#${item.reference}`}>{item.reference}</a>
                            ]
                          </sup>
                        </p>
                      </div>
                    </div>
                  );
                }
              })}
            </div>
          </article>
        ))}
      </div>
    </section>
  );
};

export default EssentialInfo;
